OpenFOAM/4.x/ERCOFTAC-SIG15/case9.4/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.463;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    celling
    {
        type            slip;
    }

    floor
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    side
    {
        type            slip;
    }

    AhmedGroup
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    "proc.*"
    {
        type            processor;
    }

}


// ************************************************************************* //
