OpenFOAM/4.x/ERCOFTAC-SIG15/case9.4/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    {
        name    f0;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name   floor_noslip;
        }
    }

    {
        name    f0;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
        {
            box (-5.0 -1.0 -0.1) (-1.5 1.0 1.0);
        }
    }

);

// ************************************************************************* //
